

//класс всегда именуется с большой буквы(ВСЕГДА)
public class too {

 public static void main(String[] args) {
	//каждый отступ делаешь табом как я сейчас сделал
		//вот отступ второго уровня
  String a = "Hello"; {
	//отделение команд между собой только ";" в смысле "{" - не нужно
	//String a = "Hello";
	//Hello Wolly;
	//String b = "Lesha";
	//так как я указал выше - нормально
	//скажи "Нет" безсмысленным именам, имен "a" и "b" - безсмысленны, 
	//Если создешь переменную с Литералом "Hello" называешь hello - 
	//переменные - только с маленьких букв
   String b = " Lesha"; {
    String results = a + b; { 
    System.out.print(results);
    }
   }
  } 
 }
}  